[sidemenu[ru/examples/sidemenu]]
[title[=Важное замечание]]

<article>
	<header>
		<h1>Важное замечание о примерах</h1>
	</header>
	<section>
		<header>
			<h1>Треубется установить PinPIE отдельно</h1>
		</header>
		<p>
			Все примеры <b>не</b> включают в себя движок PinPIE, т.к. он может меняться и обновляться со временем.
			То есть, каждый пример требует установки движка PinPIE в папку примера (или наоборот).
			Я не включаю движок в примеры, так как они не привязаны к конкретной версии.
		</p>
		<p>
			Как установить PinPIE смотри в доке
			<a href="/ru/manual/start">Начало работы с движком PinPIE</a>.
		</p>
	</section>

</article>